MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1823/mcu.h
extern volatile PORTAbits_t PORTAbits __at(0x00C);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x4
#define _PORTA_AN3_POSITION                                 0x4
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x10
#define _PORTA_CPS0_POSN                                    0x0
#define _PORTA_CPS0_POSITION                                0x0
#define _PORTA_CPS0_SIZE                                    0x1
#define _PORTA_CPS0_LENGTH                                  0x1
#define _PORTA_CPS0_MASK                                    0x1
#define _PORTA_CPS1_POSN                                    0x1
#define _PORTA_CPS1_POSITION                                0x1
#define _PORTA_CPS1_SIZE                                    0x1
#define _PORTA_CPS1_LENGTH                                  0x1
#define _PORTA_CPS1_MASK                                    0x2
#define _PORTA_CPS2_POSN                                    0x2
#define _PORTA_CPS2_POSITION                                0x2
#define _PORTA_CPS2_SIZE                                    0x1
#define _PORTA_CPS2_LENGTH                                  0x1
#define _PORTA_CPS2_MASK                                    0x4
#define _PORTA_CPS3_POSN                                    0x4
#define _PORTA_CPS3_POSITION                                0x4
#define _PORTA_CPS3_SIZE                                    0x1
#define _PORTA_CPS3_LENGTH                                  0x1
#define _PORTA_CPS3_MASK                                    0x10
#define _PORTA_C1INP_POSN                                   0x0
#define _PORTA_C1INP_POSITION                               0x0
#define _PORTA_C1INP_SIZE                                   0x1
#define _PORTA_C1INP_LENGTH                                 0x1
#define _PORTA_C1INP_MASK                                   0x1
#define _PORTA_C12IN0N_POSN                                 0x1
#define _PORTA_C12IN0N_POSITION                             0x1
#define _PORTA_C12IN0N_SIZE                                 0x1
#define _PORTA_C12IN0N_LENGTH                               0x1
#define _PORTA_C12IN0N_MASK                                 0x2
#define _PORTA_C1OUT_POSN                                   0x2
#define _PORTA_C1OUT_POSITION                               0x2
#define _PORTA_C1OUT_SIZE                                   0x1
#define _PORTA_C1OUT_LENGTH                                 0x1
#define _PORTA_C1OUT_MASK                                   0x4
#define _PORTA_nSS_POSN                                     0x3
#define _PORTA_nSS_POSITION                                 0x3
#define _PORTA_nSS_SIZE                                     0x1
#define _PORTA_nSS_LENGTH                                   0x1
#define _PORTA_nSS_MASK                                     0x8
#define _PORTA_SDO_POSN                                     0x4
#define _PORTA_SDO_POSITION                                 0x4
#define _PORTA_SDO_SIZE                                     0x1
#define _PORTA_SDO_LENGTH                                   0x1
#define _PORTA_SDO_MASK                                     0x10
#define _PORTA_TX_POSN                                      0x0
#define _PORTA_TX_POSITION                                  0x0
#define _PORTA_TX_SIZE                                      0x1
#define _PORTA_TX_LENGTH                                    0x1
#define _PORTA_TX_MASK                                      0x1
#define _PORTA_RX_POSN                                      0x1
#define _PORTA_RX_POSITION                                  0x1
#define _PORTA_RX_SIZE                                      0x1
#define _PORTA_RX_LENGTH                                    0x1
#define _PORTA_RX_MASK                                      0x2
#define _PORTA_T0CKI_POSN                                   0x2
#define _PORTA_T0CKI_POSITION                               0x2
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x4
#define _PORTA_nMCLR_POSN                                   0x3
#define _PORTA_nMCLR_POSITION                               0x3
#define _PORTA_nMCLR_SIZE                                   0x1
#define _PORTA_nMCLR_LENGTH                                 0x1
#define _PORTA_nMCLR_MASK                                   0x8
#define _PORTA_CLKR_POSN                                    0x4
#define _PORTA_CLKR_POSITION                                0x4
#define _PORTA_CLKR_SIZE                                    0x1
#define _PORTA_CLKR_LENGTH                                  0x1
#define _PORTA_CLKR_MASK                                    0x10
#define _PORTA_T1OSI_POSN                                   0x5
#define _PORTA_T1OSI_POSITION                               0x5
#define _PORTA_T1OSI_SIZE                                   0x1
#define _PORTA_T1OSI_LENGTH                                 0x1
#define _PORTA_T1OSI_MASK                                   0x20
#define _PORTA_CK_POSN                                      0x0
#define _PORTA_CK_POSITION                                  0x0
#define _PORTA_CK_SIZE                                      0x1
#define _PORTA_CK_LENGTH                                    0x1
#define _PORTA_CK_MASK                                      0x1
#define _PORTA_DT_POSN                                      0x1
#define _PORTA_DT_POSITION                                  0x1
#define _PORTA_DT_SIZE                                      0x1
#define _PORTA_DT_LENGTH                                    0x1
#define _PORTA_DT_MASK                                      0x2
#define _PORTA_FLT0_POSN                                    0x2
#define _PORTA_FLT0_POSITION                                0x2
#define _PORTA_FLT0_SIZE                                    0x1
#define _PORTA_FLT0_LENGTH                                  0x1
#define _PORTA_FLT0_MASK                                    0x4
#define _PORTA_T1OSO_POSN                                   0x4
#define _PORTA_T1OSO_POSITION                               0x4
#define _PORTA_T1OSO_SIZE                                   0x1
#define _PORTA_T1OSO_LENGTH                                 0x1
#define _PORTA_T1OSO_MASK                                   0x10
#define _PORTA_T1CKI_POSN                                   0x5
#define _PORTA_T1CKI_POSITION                               0x5
#define _PORTA_T1CKI_SIZE                                   0x1
#define _PORTA_T1CKI_LENGTH                                 0x1
#define _PORTA_T1CKI_MASK                                   0x20
#define _PORTA_DACOUT_POSN                                  0x0
#define _PORTA_DACOUT_POSITION                              0x0
#define _PORTA_DACOUT_SIZE                                  0x1
#define _PORTA_DACOUT_LENGTH                                0x1
#define _PORTA_DACOUT_MASK                                  0x1
#define _PORTA_SRI_POSN                                     0x1
#define _PORTA_SRI_POSITION                                 0x1
#define _PORTA_SRI_SIZE                                     0x1
#define _PORTA_SRI_LENGTH                                   0x1
#define _PORTA_SRI_MASK                                     0x2
#define _PORTA_SRQ_POSN                                     0x2
#define _PORTA_SRQ_POSITION                                 0x2
#define _PORTA_SRQ_SIZE                                     0x1
#define _PORTA_SRQ_LENGTH                                   0x1
#define _PORTA_SRQ_MASK                                     0x4
#define _PORTA_OSC2_POSN                                    0x4
#define _PORTA_OSC2_POSITION                                0x4
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x10
#define _PORTA_OSC1_POSN                                    0x5
#define _PORTA_OSC1_POSITION                                0x5
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x20
#define _PORTA_CLKOUT_POSN                                  0x4
#define _PORTA_CLKOUT_POSITION                              0x4
#define _PORTA_CLKOUT_SIZE                                  0x1
#define _PORTA_CLKOUT_LENGTH                                0x1
#define _PORTA_CLKOUT_MASK                                  0x10
#define _PORTA_CLKIN_POSN                                   0x5
#define _PORTA_CLKIN_POSITION                               0x5
#define _PORTA_CLKIN_SIZE                                   0x1
#define _PORTA_CLKIN_LENGTH                                 0x1
#define _PORTA_CLKIN_MASK                                   0x20

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0x00E);
#ifndef _LIB_BUILD
asm("PORTC equ 0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
    };
    struct {
        unsigned AN4                    :1;
        unsigned AN5                    :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
    };
    struct {
        unsigned CPS4                   :1;
        unsigned CPS5                   :1;
        unsigned CPS6                   :1;
        unsigned CPS7                   :1;
    };
    struct {
        unsigned C2INP                  :1;
        unsigned C12IN1N                :1;
        unsigned C12IN2N                :1;
        unsigned C12IN3N                :1;
        unsigned C2OUT                  :1;
    };
    struct {
        unsigned SCL                    :1;
        unsigned SDA                    :1;
        unsigned P1D                    :1;
        unsigned P1C                    :1;
        unsigned P1B                    :1;
        unsigned P1A                    :1;
    };
    struct {
        unsigned SCK                    :1;
        unsigned SDI                    :1;
        unsigned SDO                    :1;
        unsigned nSS                    :1;
        unsigned SRNQ                   :1;
        unsigned CCP1                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned MDCIN1                 :1;
        unsigned MDMIN                  :1;
        unsigned MDOUT                  :1;
        unsigned MDCIN2                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned TX                     :1;
        unsigned RX                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned CK                     :1;
        unsigned DT                     :1;
    };
} PORTCbits_t;
